#ifndef __OTA_H__
#define __OTA_H__

#include "TXSDKCommonDef.h"

CXX_EXTERN_BEGIN

/*
 * QQ物联智能设备升级接口
 */

 ///////////////////////////////////////////////////////////////////////
 //                                                                   //
 //                    QQ物联智能设备升级接口                         //
 //                                                                   //
 ///////////////////////////////////////////////////////////////////////

 /**
  *  QQ物联升级方案：
  *
  *                                                       |